{
  "auto_mapping": null,
  "base_model_name_or_path": "cardiffnlp/twitter-roberta-base-sentiment-latest",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 16,
  "lora_dropout": 0.1,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 4,
  "revision": null,
  "target_modules": [
    "query",
    "value"
  ],
  "task_type": "SEQ_CLS"
}